# Module 6: Perform Custom EDA (Titanic)

Author: Jaystin Garcia

Date: February 16, 2026

Purpose: In this project, I will be conducting my own exploratory data analysis on Titanic data. This project explores the Titanic passenger dataset, which contains demographic information, ticket class, fares, family relationships, and survival outcomes for passengers aboard the Titanic

# Section 1: Imports and Configuration

In [14]:
# Imports at the top of the file
# REQ.EXTERNAL.DEPS: External packages must be defined in pyproject.toml
# REQ.EXTERNAL.DEPS.INSTALLED: external packages must be installed in the environment using uv sync command
# REQ.EXTERNAL.DEPS.IMPORTED: external packages used in this notebook must be imported here


from matplotlib.axes import Axes
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

# Type hint for Axes object (basic plot type returned by Seaborn)
# A seaborn plot is a set of axes and you can set the title, labels, etc. on the axes.

# A figure can contain multiple axes (plots)
# from matplotlib.figure import Figure

# Pandas display configuration (helps in notebooks)
pd.set_option("display.max_columns", 50)
pd.set_option("display.width", 120)

print("Imports complete.")

Imports complete.

# Section 2: Load the Data

In [15]:
# Python cell

# Load the titanic dataset from Seaborn
# Into a pandas DataFrame (2D table)
titanic_df: pd.DataFrame = sns.load_dataset("titanic")

# Preview the first few rows
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# Section 3: Inspect Data and Structure

In [16]:
# Section 3 Python cell

# Get shape - number of rows and columns
shape: tuple[int, int] = titanic_df.shape

# Communicate the shape clearly
print(f"The titanic dataset has {shape[0]} rows and {shape[1]} columns.")

# Display column names and data types
titanic_df.info()

# List the column names
print("Column names:")
print(list(titanic_df.columns))

The titanic dataset has 891 rows and 15 columns.
<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    str
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    str
 8   class        891 non-null    category
 9   who          891 non-null    str
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    str
 13  alive        891 non-null    str
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), str(5)
memory usage: 80.7 KB
Column names:
['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone']

# Section 4: Create a dictionary and check data quality

In [17]:
# Count missing values in each column
print("Missing values per column:")
print(titanic_df.isnull().sum())

# Check for duplicate rows
num_duplicates = titanic_df.duplicated().sum()
print(f"Number of duplicate rows: {num_duplicates}")

Missing values per column:
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64
Number of duplicate rows: 107

# Section 5: Create Clean View for EDA
The titanic dataset contains several columns with missing values. The "deck" colum is missing for the majority of passengers, so dropping rows with missing values would remove most of the dataset. Instead, drop the entire "deck" column because it is too incomplete.

The "age" column is important for understanding survival patterns, so remove only the rows where age is missing.

After handling missing values, remove duplicate rows to ensure the clean data set contains only unique passenger records.

In [18]:
# Drop the deck column (too many missing values)
titanic_clean = titanic_df.drop(columns=["deck"])

# Drop rows missing age 
titanic_clean = titanic_clean.dropna(subset=["age"])

# Remove duplicates
titanic_clean = titanic_clean.drop_duplicates()

print("Original rows:", len(titanic_df))
print("Clean rows:", len(titanic_clean))
print("Rows removed:", len(titanic_df) - len(titanic_clean))

Original rows: 891
Clean rows: 676
Rows removed: 215

# Section 6: Descriptive Statistics for Numeric Columns

In [22]:
# Summarize the clean dataset
print("\nSummary of clean dataset:")
print(titanic_clean.describe(include="all"))

# Transpose the summary for better readability
print("\nTransposed summary of clean dataset:")
titanic_clean.describe(include="all").T

Summary of clean dataset:
          survived      pclass   sex         age       sibsp       parch        fare embarked  class  who adult_male  \
count   676.000000  676.000000   676  676.000000  676.000000  676.000000  676.000000      674    676  676        676
unique         NaN         NaN     2         NaN         NaN         NaN         NaN        3      3    3          2
top            NaN         NaN  male         NaN         NaN         NaN         NaN        S  Third  man       True
freq           NaN         NaN   421         NaN         NaN         NaN         NaN      518    334  381        381
mean      0.418639    2.221893   NaN   29.812751    0.535503    0.454142   35.851584      NaN    NaN  NaN        NaN
std       0.493701    0.847406   NaN   14.727098    0.946062    0.870571   54.074528      NaN    NaN  NaN        NaN
min       0.000000    1.000000   NaN    0.420000    0.000000    0.000000    0.000000      NaN    NaN  NaN        NaN
25%       0.000000    1.000000   NaN   20.000000    0.000000    0.000000    8.050000      NaN    NaN  NaN        NaN
50%       0.000000    2.000000   NaN   28.000000    0.000000    0.000000   16.100000      NaN    NaN  NaN        NaN
75%       1.000000    3.000000   NaN   39.000000    1.000000    1.000000   35.500000      NaN    NaN  NaN        NaN
max       1.000000    3.000000   NaN   80.000000    5.000000    6.000000  512.329200      NaN    NaN  NaN        NaN

        embark_town alive alone
count           674   676   676
unique            3     2     2
top     Southampton    no  True
freq            518   393   369
mean            NaN   NaN   NaN
std             NaN   NaN   NaN
min             NaN   NaN   NaN
25%             NaN   NaN   NaN
50%             NaN   NaN   NaN
75%             NaN   NaN   NaN
max             NaN   NaN   NaN

Transposed summary of clean dataset:

             count unique          top freq       mean        std   min   25%   50%   75%       max
survived     676.0    NaN          NaN  NaN   0.418639   0.493701   0.0   0.0   0.0   1.0       1.0
pclass       676.0    NaN          NaN  NaN   2.221893   0.847406   1.0   1.0   2.0   3.0       3.0
sex            676      2         male  421        NaN        NaN   NaN   NaN   NaN   NaN       NaN
age          676.0    NaN          NaN  NaN  29.812751  14.727098  0.42  20.0  28.0  39.0      80.0
sibsp        676.0    NaN          NaN  NaN   0.535503   0.946062   0.0   0.0   0.0   1.0       5.0
parch        676.0    NaN          NaN  NaN   0.454142   0.870571   0.0   0.0   0.0   1.0       6.0
fare         676.0    NaN          NaN  NaN  35.851584  54.074528   0.0  8.05  16.1  35.5  512.3292
embarked       674      3            S  518        NaN        NaN   NaN   NaN   NaN   NaN       NaN
class          676      3        Third  334        NaN        NaN   NaN   NaN   NaN   NaN       NaN
who            676      3          man  381        NaN        NaN   NaN   NaN   NaN   NaN       NaN
adult_male     676      2         True  381        NaN        NaN   NaN   NaN   NaN   NaN       NaN
embark_town    674      3  Southampton  518        NaN        NaN   NaN   NaN   NaN   NaN       NaN
alive          676      2           no  393        NaN        NaN   NaN   NaN   NaN   NaN       NaN
alone          676      2         True  369        NaN        NaN   NaN   NaN   NaN   NaN       NaN

In [23]:
# Numeric Summary Statistics
print("\nNumeric summary statistics:")
print(titanic_clean.describe().T)

Numeric summary statistics:
          count       mean        std   min    25%   50%   75%       max
survived  676.0   0.418639   0.493701  0.00   0.00   0.0   1.0    1.0000
pclass    676.0   2.221893   0.847406  1.00   1.00   2.0   3.0    3.0000
age       676.0  29.812751  14.727098  0.42  20.00  28.0  39.0   80.0000
sibsp     676.0   0.535503   0.946062  0.00   0.00   0.0   1.0    5.0000
parch     676.0   0.454142   0.870571  0.00   0.00   0.0   1.0    6.0000
fare      676.0  35.851584  54.074528  0.00   8.05  16.1  35.5  512.3292